libxmlbus/data/wsaddr-testset/documents/echo/soap12/message7.xml

<?xml version="1.0"?>
<!-- $Id: message7.xml,v 1.10 2006/02/20 16:01:17 pdowney Exp $ -->
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <env:Header>
    <wsa:To>http://example.org/node/A</wsa:To>
    <wsa:Action>http://example.org/action/echoIn</wsa:Action>
    <wsa:MessageID>urn:uuid:B4D743BD-6023-4173-B63C-4C29CB4350F2</wsa:MessageID>
    <wsa:ReplyTo>
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
      <wsa:ReferenceParameters xmlns:customer="http://example.org/customer">
        <customer:CustomerKey>Key#123456789</customer:CustomerKey>
      </wsa:ReferenceParameters>
    </wsa:ReplyTo>
  </env:Header>
  <env:Body>
    <m:echoIn xmlns:m="http://example.org/echo">Echo This Text</m:echoIn>
  </env:Body>
</env:Envelope>
